Обработки/Reports/_ОтчетОДоходахИРасходахБлагосостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахБлагосостояние</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахБлагосостояние/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ЭтаФорма.Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Объект.Период      = ТекущаяДата();
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.КлючТекущегоВарианта) Тогда 
		ЭтаФорма.Объект.КлючТекущегоВарианта = "Благосостояние2020";
	КонецЕсли;	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	ЭтаФорма.Заголовок = "Отчет о доходах и расходах (" + ЭтаФорма.Объект.КлючТекущегоВарианта + ")";

КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьОтчетНаСервере()
	
	РеквизитФормыВЗначение("Объект").Сформировать(Результат, Расшифровка);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьОтчетНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Объект, ЭтаФорма.НастройкиОтчета);
	
	//Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ЭтаФорма.НастройкиОтчета.Подписант);
	Объект.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	Объект.КлючТекущегоВарианта =  ЭтаФорма.НастройкиОтчета.КлючТекущегоВарианта;
	Если НЕ ЗначениеЗаполнено(Объект.КлючТекущегоВарианта) Тогда 
		Объект.КлючТекущегоВарианта = "Благосостояние2019";
	КонецЕсли;	
	ВариантОтчета = "СводныйНалоговыйРегистр";
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьОтчетНаСервере();
		РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьВариант(Команда)
	
	СписокВыбора = ПолучитьСписокВариантов();
	
	ВыбранноеЗначение = СписокВыбора.ВыбратьЭлемент("Выбор варианта отчета", СписокВыбора.НайтиПоЗначению(Объект.КлючТекущегоВарианта));
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Объект.КлючТекущегоВарианта = ВыбранноеЗначение.Значение;
		ЭтаФорма.Заголовок = "Отчет о доходах и расходах (" + ВыбранноеЗначение.Представление + ")";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокВариантов()
	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить("Благосостояние",		"Благосостояние");
	СписокВариантов.Добавить("Благосостояние2019",	"Благосостояние (2019)");
	СписокВариантов.Добавить("Благосостояние2020",	"Благосостояние (2020)");
	СписокВариантов.Добавить("Благосостояние2021",	"Благосостояние (2021)");
	
	Возврат СписокВариантов; 
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период", Отказ);	
	КонецЕсли;
	
КонецПроцедуры
